In [1]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt
% matplotlib inline

In [3]:
fifa = pd.read_csv('match_results.csv')

In [4]:
fifa.head(2)

,date,home_team,away_team,home_score,away_score,tournament,city,country,neutral
0,1872-11-30,Scotland,England,0,0,Friendly,Glasgow,Scotland,False
1,1873-03-08,England,Scotland,4,2,Friendly,London,England,False

In [5]:
fifa.shape

(38898, 9)

In [6]:
fifa.isnull().sum()

date          0
home_team     0
away_team     0
home_score    0
away_score    0
tournament    0
city          0
country       0
neutral       0
dtype: int64

In [7]:
fifa.dtypes

date          object
home_team     object
away_team     object
home_score     int64
away_score     int64
tournament    object
city          object
country       object
neutral         bool
dtype: object

In [9]:
fifa.head(5)

,date,home_team,away_team,home_score,away_score,tournament,city,country,neutral
0,1872-11-30,Scotland,England,0,0,Friendly,Glasgow,Scotland,False
1,1873-03-08,England,Scotland,4,2,Friendly,London,England,False
2,1874-03-07,Scotland,England,2,1,Friendly,Glasgow,Scotland,False
3,1875-03-06,England,Scotland,2,2,Friendly,London,England,False
4,1876-03-04,Scotland,England,3,0,Friendly,Glasgow,Scotland,False

In [10]:
fifa1 = fifa.iloc[:,[0,1,2,3,4]]

In [11]:
fifa1.head(2)

         date home_team away_team  home_score  away_score
0  1872-11-30  Scotland   England           0           0
1  1873-03-08   England  Scotland           4           2

In [12]:
fifa1['date'] = pd.to_datetime(fifa1.date)

/Users/levin/projects/python-data-science/.venv/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [14]:
fifa1.dtypes

date          datetime64[ns]
home_team             object
away_team             object
home_score             int64
away_score             int64
dtype: object

In [15]:
fifa1['date1'] = fifa1.date.dt.year

/Users/levin/projects/python-data-science/.venv/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [16]:
fifa1.head()

        date home_team away_team  home_score  away_score  date1
0 1872-11-30  Scotland   England           0           0   1872
1 1873-03-08   England  Scotland           4           2   1873
2 1874-03-07  Scotland   England           2           1   1874
3 1875-03-06   England  Scotland           2           2   1875
4 1876-03-04  Scotland   England           3           0   1876

In [17]:
fifa2 = fifa1[fifa1['date1'].isin([2010, 2014,2018]) ]

In [18]:
fifa2.head(2)

            date home_team  away_team  home_score  away_score  date1
31408 2010-01-02      Iran  Korea DPR           1           0   2010
31409 2010-01-02     Qatar       Mali           0           0   2010

In [19]:
fifa2.shape

(1823, 6)

In [20]:
fifa_stats = pd.read_csv('fifa_stats.csv')

In [22]:
fifa_stats.head(2)

,age,dob,full_name,image,nation,potential,rating,short_name,value,wage,year,fifa_rank
0,23,"Feb 2, 1994",E. Hysaj,https://cdn.sofifa.org/1x/18/players/210864.png,Albania,84.0,80.0,E. Hysaj,16.0,58.0,2010,0.488283
1,22,"Mar 19, 1995",T. Strakosha,https://cdn.sofifa.org/1x/18/players/212151.png,Albania,1.0,79.0,T. Strakosha,89.0,1.0,2010,0.878615

In [28]:
fifa_agg = fifa_stats.loc[:,['nation','rating',
                  'year'] ].groupby(['nation', 'year']).mean()

In [30]:
fifarank = pd.read_csv('fifa_rank.csv')

In [31]:
fifarank.head()

  Unnamed: 0  Value of Starting 11  Fifa Ranking
0     Russia                   855            66
1     Brazil                   933             2
2       Iran                   778            36
3      Japan                   839            60
4     Mexico                   863            15

In [32]:
fifa_agg.head(1)

                  rating
nation      year
Afghanistan 2018    59.5

In [33]:
fifa2.head(1)

            date home_team  away_team  home_score  away_score  date1
31408 2010-01-02      Iran  Korea DPR           1           0   2010

In [35]:
fifa2['label'] = 2

/Users/levin/projects/python-data-science/.venv/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [39]:
index_label0 = fifa2[fifa2['home_score'] > fifa2['away_score']].index

In [38]:
index_label1 = fifa2[fifa2['home_score'] < fifa2['away_score']].index

In [43]:
fifa2.loc[index_label0,'label'] = 0

/Users/levin/projects/python-data-science/.venv/lib/python3.6/site-packages/pandas/core/indexing.py:537: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self.obj[item] = s

In [44]:
fifa2.loc[index_label1,'label'] = 1

/Users/levin/projects/python-data-science/.venv/lib/python3.6/site-packages/pandas/core/indexing.py:537: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self.obj[item] = s

In [45]:
fifa2.head()

            date home_team   away_team  home_score  away_score  date1  label
31408 2010-01-02      Iran   Korea DPR           1           0   2010      0
31409 2010-01-02     Qatar        Mali           0           0   2010      2
31410 2010-01-02     Syria    Zimbabwe           6           0   2010      0
31411 2010-01-02     Yemen  Tajikistan           0           1   2010      1
31412 2010-01-03    Angola      Gambia           1           1   2010      2

In [54]:
fifa_reset = fifa_agg.reset_index()

In [51]:
fifarank=fifarank.rename(columns={'Unnamed: 0': "Team"})

In [52]:
fifarank.head()

     Team  Value of Starting 11  Fifa Ranking
0  Russia                   855            66
1  Brazil                   933             2
2    Iran                   778            36
3   Japan                   839            60
4  Mexico                   863            15

In [58]:
team_features=fifarank.merge(fifa_reset, left_on="Team", right_on="nation", how='inner')
team_features.head()

     Team  Value of Starting 11  Fifa Ranking  nation  year     rating
0  Russia                   855            66  Russia  2010  72.400000
1  Russia                   855            66  Russia  2018  64.000000
2  Brazil                   933             2  Brazil  2014  79.575758
3    Iran                   778            36    Iran  2018  71.826087
4   Japan                   839            60   Japan  2018  71.242424

In [60]:
team_fer=team_features.loc[:,['Team', 'Fifa Ranking', 'year', 'rating']]

In [63]:
fifa3=fifa2.loc[:,['home_team', 'away_team', 'date1', 'label']]
fifa3.head()

      home_team   away_team  date1  label
31408      Iran   Korea DPR   2010      0
31409     Qatar        Mali   2010      2
31410     Syria    Zimbabwe   2010      0
31411     Yemen  Tajikistan   2010      1
31412    Angola      Gambia   2010      2

In [65]:
fifa4=fifa3.merge(team_fer, left_on=["home_team", "date1"], right_on=["Team", "year"], how='inner')

In [67]:
fifa5=fifa4.rename(columns={'Fifa Ranking': "home_rank", 'rating': 'home_rating'})

In [71]:
fifa6=fifa5.merge(team_fer, left_on=["away_team", "date1"], right_on=["Team", "year"], how='inner')

In [74]:
fifa7=fifa6.rename(columns={'Fifa Ranking': "away_rank", 'rating': 'away_rating', 'date1': 'year'})
fifa7.head()

,home_team,away_team,year,label,Team_x,home_rank,year_x,home_rating,Team_y,away_rank,year_y,away_rating
0,Poland,Australia,2010,1,Poland,10,2010,73.030303,Australia,26,2010,60.0000
1,Germany,Australia,2010,0,Germany,1,2010,79.787879,Australia,26,2010,60.0000
2,Australia,Denmark,2010,0,Australia,26,2010,60.000000,Denmark,12,2010,74.8125
3,Portugal,Denmark,2010,0,Portugal,4,2010,77.878788,Denmark,12,2010,74.8125
4,Belgium,Croatia,2010,1,Belgium,3,2010,80.818182,Croatia,18,2010,78.3125

In [76]:
fifa8=fifa7.loc[:,["year", "home_team", "away_team", "home_rank", "away_rank", "home_rating", "away_rating", "label"]]
fifa8.head()

,year,home_team,away_team,home_rank,away_rank,home_rating,away_rating,label
0,2010,Poland,Australia,10,26,73.030303,60.0000,1
1,2010,Germany,Australia,1,26,79.787879,60.0000,0
2,2010,Australia,Denmark,26,12,60.000000,74.8125,0
3,2010,Portugal,Denmark,4,12,77.878788,74.8125,0
4,2010,Belgium,Croatia,3,18,80.818182,78.3125,1

In [78]:
fifa8["rank_dif"]=fifa8.home_rank-fifa8.away_rank
fifa8.head()

,year,home_team,away_team,home_rank,away_rank,home_rating,away_rating,label,rank_dif
0,2010,Poland,Australia,10,26,73.030303,60.0000,1,-16
1,2010,Germany,Australia,1,26,79.787879,60.0000,0,-25
2,2010,Australia,Denmark,26,12,60.000000,74.8125,0,14
3,2010,Portugal,Denmark,4,12,77.878788,74.8125,0,-8
4,2010,Belgium,Croatia,3,18,80.818182,78.3125,1,-15

In [79]:
fifa8["rating_dif"]=fifa8.home_rating-fifa8.away_rating

In [80]:
fifa9=fifa8.loc[:,["year", "home_team", "away_team", "rank_dif", "rating_dif", "label"]]

In [83]:
fifa9

    year    home_team     away_team  rank_dif  rating_dif  label
0   2010       Poland     Australia       -16   13.030303      1
1   2010      Germany     Australia       -25   19.787879      0
2   2010    Australia       Denmark        14  -14.812500      0
3   2010     Portugal       Denmark        -8    3.066288      0
4   2010      Belgium       Croatia       -15    2.505682      1
5   2010      Belgium       Germany         2    1.030303      1
6   2010      Denmark       Germany        11   -4.975379      2
7   2010       Sweden       Germany        22  -12.787879      2
8   2010      England        France         6   -4.652462      1
9   2010      Germany       England       -12    5.909091      0
10  2010      Iceland      Portugal        18   -7.151515      1
11  2010      Denmark       Iceland       -10    4.085227      0
12  2010       Russia       Belgium        63   -8.418182      1
13  2014   Costa Rica        Panama       -30    3.794613      2
14  2014       Mexico        Panama       -40    5.249158      0
15  2014       Brazil        Panama       -53   11.946128      0
16  2014     Colombia       Uruguay        -1    0.272727      0
17  2014      Germany     Argentina        -4  -11.187500      0
18  2014      Germany     Argentina        -4  -11.187500      1
19  2014        Spain       Germany         7   10.212121      1
20  2014       Brazil       Germany         1   10.575758      1
21  2014  Switzerland          Peru        -5    1.331439      0
22  2014      Uruguay    Costa Rica        -8    5.090909      1
23  2014      Uruguay    Costa Rica        -8    5.090909      2
24  2014       Brazil        Serbia       -33    4.393939      0
25  2014       Brazil        Mexico       -13    6.696970      2
26  2014       Brazil      Colombia       -14    2.787879      0
27  2014    Argentina   Switzerland        -1    7.250000      0
28  2014    Argentina        Brazil         3    0.611742      1
29  2018     Portugal         Egypt       -42    4.516129      0
30  2018       Russia        France        59   -7.333333      1
31  2018      Tunisia          Iran       -22   -2.492754      0
32  2018      Belgium  Saudi Arabia       -67   -0.863636      0

In [82]:
fifa9.to_csv("Training_fifa.csv",index=False)